test/FasTnT.IntegrationTests/Requests/Queries/Subscribe.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:epcglobal:epcis-query:xsd:1">
  <soapenv:Header />
  <soapenv:Body>
    <urn:Subscribe>
      <queryName>SimpleEventQuery</queryName>
      <params>
        <param>
          <name>eventType</name>
          <value>
            <value>AggregationEvent</value>
          </value>
        </param>
      </params>
      <dest>http://localhost:54805/v1_2/Capture</dest>
      <controls>
        <schedule>
          <second>0</second>
        </schedule>
        <reportIfEmpty>true</reportIfEmpty>
      </controls>
      <subscriptionID>TestSubscription</subscriptionID>
    </urn:Subscribe>
  </soapenv:Body>
</soapenv:Envelope>